---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateFacesError
source: html/e2751050-a67a-eab9-2bfd-5763a296335f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateFacesError Property

Couldn't generate surfaces for stairs.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotGenerateFacesError { get; }
```